Revit 2026 API
PathReinforcement.Create Method
Overload List
Name | Description
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId)
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId, ElementId)
Top
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace